
/***************************************************************************************************************************************************/
char* frequencySort(char* s) {
    //字符串长度小于2，直接返回
    int len = strlen(s);
    if (len < 2) { return s; }

    //记录字符串中字母出现的次数
    int temp[128] = { 0 };
    int i = 0;
    while (s[i] != '\0')    //while改为for循环程序速度变慢
    {
        temp[s[i]]++;
        i++;
    }

    //psort排序子函数
    int com(const void* a, const void* b)
    {
        int n = *(char*)a;
        int m = *(char*)b;

        return temp[n] == temp[m] ? n > m : temp[n] < temp[m];
    }

    //qsort排序
    qsort(s, len, sizeof(char), com);

    //返回排序后的s
    return s;
}

/***************************************************************************************************************************************************/



